wisteria-1c/Конфигурация/Catalogs/ПалитраТоваровРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПалитраТоваровРМК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементовВРяду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРядов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтЭлементовПодбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникЗаполненияПалитрыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидНоменклатуры</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидНоменклатурыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяОсобенностьУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОсобенностиУчетаНоменклатурыРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодпискаНаНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПодписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаПапки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаСопутствующегоТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаВыбранногоЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоКатегория</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКатегории</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКатегорииРазмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзображениеЭлемента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМКПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шрифт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветШрифта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияРазмещения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.АльтернативнаяГруппировкаИзбранныхТоваровРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмеетсяВложенность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидМодификатора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМодификаторовРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УпаковкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкрыватьОстаток</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Палитра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПустаяОбласть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартинкаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ПалитраТоваровРМК/Forms/ПлиточныйИнтерфейсВыбораТоваров/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Таблица клиентская (массив структур) с иерархией построения плитки для текущего типа построения.
&НаКлиенте
Перем ДанныеДляПлитки Экспорт;

// Структура с возможными вариантами типов построения плитки: 0 - по палитре, 1 - весовой товар,
// 3 - распознанный весовой товар.
&НаКлиенте
Перем ТипыПостроенияПлитки Экспорт;

// Текущий тип построения плитки.
&НаКлиенте
Перем ТипПостроенияПлитки Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЦветаФормы = ОбщегоНазначенияРМК.ЦветаФормыРМК();
	ПредставлениеВалюты = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	
	Параметры.Свойство("ТекущийТорговыйОбъект", ТекущийТорговыйОбъект);
	
	Если Не ЗначениеЗаполнено(ТекущийТорговыйОбъект) Тогда
		ТекущийТорговыйОбъект = ОбщегоНазначенияРМК.ТекущийТорговыйОбъект();
	КонецЕсли;
	
	Параметры.Свойство("СтруктураПлиточногоИнтерфейса", СтруктураПлиточногоИнтерфейсаПодбора);
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		ЗначенияОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураПлиточногоИнтерфейсаПодбора,
			"СкрыватьЦену,Наименование");
		СкрыватьЦену = ЗначенияОбъекта.СкрыватьЦену;
		Заголовок = ЗначенияОбъекта.Наименование;
		НаименованиеПалитры = ЗначенияОбъекта.Наименование;
	КонецЕсли;
	
	ПодготовитьПлиточныйИнтерфейсПодбора();
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтерфейсРМКСлужебныйКлиент.ИнициализироватьТипыПостроенияПлитки(ЭтотОбъект);
	ДанныеДляПлитки = Новый Массив;
	ТипПостроенияПлитки = ТипыПостроенияПлитки.ПоПалитре;
	ИнтерфейсРМКСлужебныйКлиент.ПодготовитьДанныеДляПлитки(ЭтотОбъект);
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПлиткаДомой(Команда)
	ПерейтиНаСтраницуДомой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПлиткаНазад(Элемент, СтандартнаяОбработка)
	
	ПереключитьСтраницуПлитки(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлиткаВперед(Элемент, СтандартнаяОбработка)
	
	ПереключитьСтраницуПлитки(1);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПлиткаВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерНажатой = Число(ИнтерфейсРМКСлужебныйКлиент.ПолучитьНомерНажатойПлитки(Элемент));
	ТекущийЭлемент = Элементы.ЗавершитьПодборТоваров;
	СтрокаНажатойКнопки = ДанныеКнопокПлиток.Получить(НомерНажатой);
	
	Если СтрокаНажатойКнопки.ЭтоКатегория ИЛИ СтрокаНажатойКнопки.ЭтоТекущаяКатегория
			ИЛИ СтрокаНажатойКнопки.ИмеетсяВложенность Тогда
			
		ТекущийПервыйИндексПлитки = СтрокаНажатойКнопки.ПервыйИндексПлитки;
		ТекущийВторойИндексПлитки = СтрокаНажатойКнопки.ВторойИндексПлитки;
		ЗаполнитьКнопкиПлиток();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПлиточныйИнтерфейсПодбора()
	
	ЗагрузитьИсходныеДанные();
	Если ОпорныеДанные.Количество() > 0 Тогда
		ИнтерфейсРМКСлужебный.СформироватьЭлементыПлиток(ЭтотОбъект);
	Иначе
		Элементы.ГруппаУведомленияОПустойСтруктуре.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьСтраницуПлитки(Дельта)
	
	КоличествоПлиток = КоличествоЭлементовВРяду * КоличествоРядовНаСтранице;
	СтрокаДанных = ДанныеДляПлитки[ТекущийПервыйИндексПлитки];
	ТекущаяКатегорияРамещения = СтрокаДанных.НомерКатегорииРазмещенияЭлемента;
	Если ТекущаяКатегорияРамещения = 0 Тогда
		ТекущийПервыйИндексПлитки = ТекущийПервыйИндексПлитки + Дельта * (КоличествоПлиток - 1);
		ТекущийВторойИндексПлитки = 0;
	Иначе
		ТекущийВторойИндексПлитки = ТекущийВторойИндексПлитки + Дельта * (КоличествоПлиток - 2);
	КонецЕсли;
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуДомой()
	
	ТекущийПервыйИндексПлитки = 0;
	ТекущийВторойИндексПлитки = 0;
	ЗаполнитьКнопкиПлиток();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсходныеДанные()
	
	Если ЗначениеЗаполнено(СтруктураПлиточногоИнтерфейсаПодбора) Тогда
		
		ИнтерфейсРМКСлужебный.ЗаполнитьОпорныеДанныеПанелиПлиточногоИнтерфейса(ЭтотОбъект);
		ОбщегоНазначенияРМК.ДополнитьОпорныеДанныеПанелиДляПостроенияПлиточногоИнтерфейса(ЭтотОбъект);
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКнопкиПлиток()
	
	ИнтерфейсРМКСлужебныйКлиент.ЗаполнитьКнопкиПлиток(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
